name: File Download or Read to Pipe Execution
id: 26f86252-1549-45e1-a212-eb26840e86bc
version: 2
date: '2025-11-25'
author: Michael Haag, Nasreddine Bencherchali, Splunk, DipsyTipsy
status: production
type: TTP
description: |
  The following analytic detects the use of download or file reading utilities from Windows, Linux or MacOS to download or read the contents of a file from a remote or local source and pipe it directly to a shell for execution.
  This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on command-line executions.
  This activity is significant as it is commonly associated with malicious actions like coinminers and exploits such as CVE-2021-44228 in Log4j.
  If confirmed malicious, this behavior could allow attackers to execute arbitrary code, potentially leading to system compromise and unauthorized access to sensitive data.
data_source:
  - Sysmon EventID 1
  - Sysmon for Linux EventID 1
  - Windows Event Log Security 4688
  - CrowdStrike ProcessRollup2
search: |
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime

  from datamodel=Endpoint.Processes where

  ``` This aims to cover download utilities and file reading ones ```

  Processes.process IN (
    "*.DownloadFile(*",
    "*.DownloadString(*",
    "*ASCII.GetString*",
    "*bitsadmin*",
    "*certutil*",
    "*curl*",
    "*Invoke-RestMethod*",
    "*Invoke-WebRequest*",
    "*irm*",
    "*iwr *",
    "*mshta*",
    "*wget*"
  )

  Processes.process IN ("*|*")

  (
    ``` Linux / MacOS ```
    Processes.process IN (
      "*bash*",
      "*csh*",
      "*dash*",
      "*fish*",
      "*ksh*",
      "*rbash*",
      "*tcsh*",
      "*zsh*"
    )
    OR
    ``` Because the "sh" string can overlap and is a short atom we treat it in a special case ```
    Processes.process IN (
      "*|sh"
      "* sh*"
    )
    OR
    ``` Windows ```
    Processes.process IN ("*IEX*", "*Invoke-Expression*")
  )

  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
     Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
     Processes.parent_process_name Processes.parent_process_path Processes.process
     Processes.process_exec Processes.process_guid Processes.process_hash Processes.process_id
     Processes.process_integrity_level Processes.process_name Processes.process_path Processes.user
     Processes.user_id Processes.vendor_product

  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `file_download_or_read_to_pipe_execution_filter`
how_to_implement: |
  The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: |
  False positives should be limited, however filtering may be required.
references:
  - https://gist.github.com/nathanqthai/01808c569903f41a52e7e7b575caa890
  - https://github.com/MHaggis/notes/blob/master/utilities/warp_pipe_tester.py
  - https://www.huntress.com/blog/rapid-response-critical-rce-vulnerability-is-affecting-java
  - https://www.lunasec.io/docs/blog/log4j-zero-day/
  - https://securelist.com/bad-magic-apt/109087/
drilldown_searches:
  - name: View the detection results for - "$user$" and "$dest$"
    search: '%original_detection_search% | search  user = "$user$" dest = "$dest$"'
    earliest_offset: $info_min_time$
    latest_offset: $info_max_time$
  - name: View risk events for the last 7 days for - "$user$" and "$dest$"
    search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$user$",
      "$dest$") starthoursago=168  | stats count min(_time) as firstTime max(_time)
      as lastTime values(search_name) as "Search Name" values(risk_message) as "Risk
      Message" values(analyticstories) as "Analytic Stories" values(annotations._all)
      as "Annotations" values(annotations.mitre_attack.mitre_tactic) as "ATT&CK Tactics"
      by normalized_risk_object | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`'
    earliest_offset: $info_min_time$
    latest_offset: $info_max_time$
rba:
  message: An instance of $process_name$ was identified on endpoint $dest$ attempting
    to immediately read or download a file and run it via a shell.
  risk_objects:
    - field: user
      type: user
      score: 80
    - field: dest
      type: system
      score: 80
  threat_objects:
    - field: process_name
      type: process_name
    - field: process
      type: process_name
tags:
  analytic_story:
    - Compromised Windows Host
    - Ingress Tool Transfer
    - Linux Living Off The Land
    - Log4Shell CVE-2021-44228
    - NPM Supply Chain Compromise
  asset_type: Endpoint
  cve:
    - CVE-2021-44228
  mitre_attack_id:
    - T1105
  product:
    - Splunk Enterprise
    - Splunk Enterprise Security
    - Splunk Cloud
  security_domain: endpoint
tests:
  - name: True Positive Test - Windows
    attack_data:
    - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1105/download_to_pipe_exec/download_to_pipe_exec.log
      source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
      sourcetype: XmlWinEventLog
  - name: True Positive Test - Linux
    attack_data:
    - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1105/download_to_pipe_exec/download_to_pipe_exec_linux.log
      source: Syslog:Linux-Sysmon/Operational
      sourcetype: sysmon:linux
