name: Shai-Hulud 2 Exfiltration Artifact Files
id: 9e7d3c0f-4a5b-6c8d-1e2f-3a4b5c6d7e8f
version: 1
date: '2025-11-25'
author: Michael Haag, Splunk
status: production
type: TTP
description: |
  Detects creation of exfiltration artifact files associated with Shai-Hulud 2.0 npm supply
  chain malware. The malware creates cloud.json, contents.json, environment.json, truffleSecrets.json,
  and actionsSecrets.json files containing harvested credentials from AWS, Azure, GCP, GitHub secrets,
  and environment variables. These files are staged before being pushed to attacker-controlled repositories.
data_source:
- Sysmon for Linux EventID 11
- Sysmon EventID 11
search: |
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime
  
  from datamodel=Endpoint.Filesystem where
  
  Filesystem.file_name IN (
    "cloud.json",
    "contents.json",
    "environment.json",
    "truffleSecrets.json",
    "actionsSecrets.json"
  )

  by Filesystem.action Filesystem.dest Filesystem.file_access_time Filesystem.file_create_time
     Filesystem.file_hash Filesystem.file_modify_time Filesystem.file_name Filesystem.file_path Filesystem.file_acl Filesystem.file_size Filesystem.process_guid Filesystem.process_id Filesystem.user
     Filesystem.vendor_product
  
  | `drop_dm_object_name(Filesystem)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `shai_hulud_2_exfiltration_artifact_files_filter`
how_to_implement: |
  The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain filesystem events, specifically file creation
  events. These logs must be processed using the appropriate Splunk Technology Add-ons
  that are specific to the EDR product. The logs must also be mapped to the `Filesystem`
  node of the `Endpoint` data model. Use the Splunk Common Information Model (CIM)
  to normalize the field names and speed up the data modeling process.
known_false_positives: |
  Low but possible. Generic filenames like cloud.json or environment.json may appear in legitimate contexts. Correlate with npm install activity or suspicious parent processes.
references:
  - https://www.wiz.io/blog/shai-hulud-2-0-ongoing-supply-chain-attack
  - https://securelist.com/shai-hulud-worm-infects-500-npm-packages-in-a-supply-chain-attack/117547/
drilldown_searches:
  - name: View the detection results for - "$dest$"
    search: '%original_detection_search% | search dest = "$dest$"'
    earliest_offset: $info_min_time$
    latest_offset: $info_max_time$
  - name: View risk events for the last 7 days for - "$dest$"
    search: '| from datamodel Risk.All_Risk | search normalized_risk_object IN ("$dest$")
      starthoursago=168  | stats count min(_time) as firstTime max(_time) as lastTime
      values(search_name) as "Search Name" values(risk_message) as "Risk Message" values(analyticstories)
      as "Analytic Stories" values(annotations._all) as "Annotations" values(annotations.mitre_attack.mitre_tactic)
      as "ATT&CK Tactics" by normalized_risk_object | `security_content_ctime(firstTime)`
      | `security_content_ctime(lastTime)`'
    earliest_offset: $info_min_time$
    latest_offset: $info_max_time$
rba:
  message: Shai-Hulud 2.0 exfiltration artifact $file_name$ created on $dest$
  risk_objects:
    - field: dest
      type: system
      score: 35
  threat_objects:
    - field: file_name
      type: file_name
      score: 25
tags:
  analytic_story:
    - NPM Supply Chain Compromise
  asset_type: Endpoint
  mitre_attack_id:
    - T1074.001
    - T1552.001
    - T1195.002
  product:
    - Splunk Enterprise
    - Splunk Enterprise Security
    - Splunk Cloud
  security_domain: endpoint
tests:
- name: True Positive Test - Linux
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1195.001/npm/shai_hulud_workflow_sysmon.log
    source: Syslog:Linux-Sysmon/Operational
    sourcetype: sysmon:linux
- name: True Positive Test - Windows
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1195.001/npm/windows_workflow_sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
